In [6]:
#Data gathering and cleaning
#cleaning the data
#Checking for a missing values
import pandas as pd
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat","Bat","Bat","Bat","Bat"],
     "50's":["100","76","45","46","100"],
     "100's":["99","54","32","23","99"],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
print("*********")
df.drop_duplicates(inplace=True)
print(df)

      Name Role 50's 100's   Avg
0   Sachin  Bat  100    99  45.5
1    Rohit  Bat   76    54  54.2
2   Dravid  Bat   45    32  34.3
3  Ganguly  Bat   46    23  40.0
4   Sachin  Bat  100    99  45.5
*********
      Name Role 50's 100's   Avg
0   Sachin  Bat  100    99  45.5
1    Rohit  Bat   76    54  54.2
2   Dravid  Bat   45    32  34.3
3  Ganguly  Bat   46    23  40.0

In [10]:
import pandas as pd
import numpy as np
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat",np.nan,"Bat","Bat","Bat"],
     "50's":["100","76","45","46","100"],
     "100's":["99","54","32","23","99"],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
df.fillna(0,inplace=True)
print("*********")
print(df)

      Name Role 50's 100's   Avg
0   Sachin  Bat  100    99  45.5
1    Rohit  NaN   76    54  54.2
2   Dravid  Bat   45    32  34.3
3  Ganguly  Bat   46    23  40.0
4   Sachin  Bat  100    99  45.5
*********
      Name Role 50's 100's   Avg
0   Sachin  Bat  100    99  45.5
1    Rohit    0   76    54  54.2
2   Dravid  Bat   45    32  34.3
3  Ganguly  Bat   46    23  40.0
4   Sachin  Bat  100    99  45.5

In [12]:
import pandas as pd
import numpy as np
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat123",np.nan,"Bat","Bat","Bat"],
     "50's":["100","76","45","46","100"],
     "100's":["99","54","32","23","99"],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
df.fillna(method="ffill",inplace=True)  #ffill/pad
print("*********")
print(df)

      Name    Role 50's 100's   Avg
0   Sachin  Bat123  100    99  45.5
1    Rohit     NaN   76    54  54.2
2   Dravid     Bat   45    32  34.3
3  Ganguly     Bat   46    23  40.0
4   Sachin     Bat  100    99  45.5
*********
      Name    Role 50's 100's   Avg
0   Sachin  Bat123  100    99  45.5
1    Rohit  Bat123   76    54  54.2
2   Dravid     Bat   45    32  34.3
3  Ganguly     Bat   46    23  40.0
4   Sachin     Bat  100    99  45.5

In [13]:
import pandas as pd
import numpy as np
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat",np.nan,"Bat111","Bat","Bat"],
     "50's":["100","76","45","46","100"],
     "100's":["99","54","32","23","99"],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
df.fillna(method="bfill",inplace=True)  
print("*********")
print(df)

      Name    Role 50's 100's   Avg
0   Sachin     Bat  100    99  45.5
1    Rohit     NaN   76    54  54.2
2   Dravid  Bat111   45    32  34.3
3  Ganguly     Bat   46    23  40.0
4   Sachin     Bat  100    99  45.5
*********
      Name    Role 50's 100's   Avg
0   Sachin     Bat  100    99  45.5
1    Rohit  Bat111   76    54  54.2
2   Dravid  Bat111   45    32  34.3
3  Ganguly     Bat   46    23  40.0
4   Sachin     Bat  100    99  45.5

In [14]:
import pandas as pd
import numpy as np
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat",np.nan,"Bat111","Bat","Bat"],
     "50's":["100","76","45",np.nan,"100"],
     "100's":["99","54","32","23",np.nan],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
df.fillna(method="bfill",inplace=True)  
print("*********")
print(df)

      Name    Role 50's 100's   Avg
0   Sachin     Bat  100    99  45.5
1    Rohit     NaN   76    54  54.2
2   Dravid  Bat111   45    32  34.3
3  Ganguly     Bat  NaN    23  40.0
4   Sachin     Bat  100   NaN  45.5
*********
      Name    Role 50's 100's   Avg
0   Sachin     Bat  100    99  45.5
1    Rohit  Bat111   76    54  54.2
2   Dravid  Bat111   45    32  34.3
3  Ganguly     Bat  100    23  40.0
4   Sachin     Bat  100   NaN  45.5

In [19]:
import pandas as pd
data={"Name":["Sachin","Rohit","Dravid","Ganguly","Sachin"],
      "Role":["Bat","Bat","Bat","Bat","Bat"],
     "50's":[100,np.nan,45,46,100],
     "100's":["99","54","32","23","99"],
     "Avg":["45.5","54.2","34.3","40.0","45.5"]}
df=pd.DataFrame(data)
print(df)
m=df["50's"].mean()
print(m)
df.fillna(m,inplace=True)  
print("*********")
print(df)

      Name Role   50's 100's   Avg
0   Sachin  Bat  100.0    99  45.5
1    Rohit  Bat    NaN    54  54.2
2   Dravid  Bat   45.0    32  34.3
3  Ganguly  Bat   46.0    23  40.0
4   Sachin  Bat  100.0    99  45.5
72.75
*********
      Name Role    50's 100's   Avg
0   Sachin  Bat  100.00    99  45.5
1    Rohit  Bat   72.75    54  54.2
2   Dravid  Bat   45.00    32  34.3
3  Ganguly  Bat   46.00    23  40.0
4   Sachin  Bat  100.00    99  45.5

In [20]:
import pandas as pd
import numpy as np
dataset = pd.DataFrame(np.random.randn(5, 3),index=['a', 'c', 'e', 'f', 'h'],
                       columns=['stock1','stock2', 'stock3'])
dataset.rename(columns={"one":'stock1',"two":'stock2',"three":'stock3'},
               inplace=True)

dataset = dataset.reindex(['a', 'b', 'c', 'd', 'e','f', 'g', 'h'])
dataset

     stock1    stock2    stock3
a -0.246864  0.236615  1.571713
b       NaN       NaN       NaN
c -1.229368  0.847307 -0.172046
d       NaN       NaN       NaN
e -0.087137  0.930985  0.198386
f  1.498452  1.243212 -0.938343
g       NaN       NaN       NaN
h -0.255612 -0.943882 -0.295388

In [28]:
print(dataset.dropna())

a   -0.246864
c   -1.229368
e   -0.087137
f    1.498452
h   -0.255612
Name: stock1, dtype: float64

In [22]:
dataset.fillna(0)

     stock1    stock2    stock3
a -0.246864  0.236615  1.571713
b  0.000000  0.000000  0.000000
c -1.229368  0.847307 -0.172046
d  0.000000  0.000000  0.000000
e -0.087137  0.930985  0.198386
f  1.498452  1.243212 -0.938343
g  0.000000  0.000000  0.000000
h -0.255612 -0.943882 -0.295388

In [33]:
import pandas as pd
import numpy as np
dataset = pd.DataFrame(np.random.randn(5, 3),index=['a', 'c', 'e', 'f', 'h'],
                       columns=['stock1','stock2', 'stock3'])
dataset.rename(columns={"one":'stock1',"two":'stock2',"three":'stock3'},
               inplace=True)

dataset = dataset.reindex(['a', 'b', 'c', 'd', 'e','f', 'g', 'h'])
print(dataset)
dataset.dropna()

     stock1    stock2    stock3
a -0.422088 -0.649007 -0.149757
b       NaN       NaN       NaN
c -0.837370  0.514685 -0.495569
d       NaN       NaN       NaN
e  2.942297 -1.336816 -0.036692
f  0.823848  1.823233  0.259604
g       NaN       NaN       NaN
h -0.254734 -3.212789 -0.231399

     stock1    stock2    stock3
a -0.422088 -0.649007 -0.149757
c -0.837370  0.514685 -0.495569
e  2.942297 -1.336816 -0.036692
f  0.823848  1.823233  0.259604
h -0.254734 -3.212789 -0.231399

In [39]:
import pandas as pd
import numpy as np
dataset = pd.DataFrame(np.random.randn(5, 3),index=['a', 'c', 'e', 'f', 'h'],
                       columns=['stock1','stock2', 'stock3'])
dataset.rename(columns={"one":'stock1',"two":'stock2',"three":'stock3'},
               inplace=True)

dataset = dataset.reindex(['a', 'b', 'c', 'd', 'e','f', 'g', 'h'])
print(dataset)
dataset.dropna(thresh=1)

     stock1    stock2    stock3
a -0.999914 -0.936087 -0.082146
b       NaN       NaN       NaN
c -1.242817 -0.925603  0.455028
d       NaN       NaN       NaN
e -3.104984 -1.808665 -1.443740
f  0.136797 -0.714736  1.617638
g       NaN       NaN       NaN
h -0.326945 -1.113776 -0.094525

     stock1    stock2    stock3
a -0.999914 -0.936087 -0.082146
c -1.242817 -0.925603  0.455028
e -3.104984 -1.808665 -1.443740
f  0.136797 -0.714736  1.617638
h -0.326945 -1.113776 -0.094525

In [43]:
df1 = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                  "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                          pd.NaT]})
print(df1)
df1.dropna(thresh=2)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [42]:
df1.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [45]:
df1 = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                  "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                          pd.NaT]})
print(df1)
df1.dropna(thresh=3)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [48]:
import pandas as pd
sales=pd.read_csv("sales.csv")
print("\n\n<<<<<<<< First 5 records >>>>>>>>\n\n")
print(sales.head())

<<<<<<<< First 5 records >>>>>>>>


    Invoice ID Branch       City Customer type  Gender  \
0  750-67-8428      A     Yangon        Member  Female
1  226-31-3081      C  Naypyitaw        Normal  Female
2  631-41-3108      A     Yangon        Normal    Male
3  123-19-1176      A     Yangon        Member    Male
4  373-73-7910      A     Yangon        Normal    Male

             Product line  Unit price  Quantity   Tax 5%     Total       Date  \
0       Health and beauty       74.69         7  26.1415  548.9715   1/5/2019
1  Electronic accessories       15.28         5   3.8200   80.2200   3/8/2019
2      Home and lifestyle       46.33         7  16.2155  340.5255   3/3/2019
3       Health and beauty       58.22         8  23.2880  489.0480  1/27/2019
4       Sports and travel       86.31         7  30.2085  634.3785   2/8/2019

    Time      Payment    cogs  gross margin percentage  gross income  Rating
0  13:08      Ewallet  522.83                 4.761905       26.1415     9.1
1  10:29         Cash   76.40                 4.761905        3.8200     9.6
2  13:23  Credit card  324.31                 4.761905       16.2155     7.4
3  20:33      Ewallet  465.76                 4.761905       23.2880     8.4
4  10:37      Ewallet  604.17                 4.761905       30.2085     5.3

In [49]:
import pandas as pd
sales=pd.read_csv("sales.csv")
print("\n\n<<<<<<<< First 5 records >>>>>>>>\n\n")
print(sales.tail())

<<<<<<<< First 5 records >>>>>>>>


      Invoice ID Branch       City Customer type  Gender         Product line  \
995  233-67-5758      C  Naypyitaw        Normal    Male    Health and beauty
996  303-96-2227      B   Mandalay        Normal  Female   Home and lifestyle
997  727-02-1313      A     Yangon        Member    Male   Food and beverages
998  347-56-2442      A     Yangon        Normal    Male   Home and lifestyle
999  849-09-3807      A     Yangon        Member  Female  Fashion accessories

     Unit price  Quantity   Tax 5%      Total       Date   Time  Payment  \
995       40.35         1   2.0175    42.3675  1/29/2019  13:46  Ewallet
996       97.38        10  48.6900  1022.4900   3/2/2019  17:16  Ewallet
997       31.84         1   1.5920    33.4320   2/9/2019  13:22     Cash
998       65.82         1   3.2910    69.1110  2/22/2019  15:33     Cash
999       88.34         7  30.9190   649.2990  2/18/2019  13:28     Cash

       cogs  gross margin percentage  gross income  Rating
995   40.35                 4.761905        2.0175     6.2
996  973.80                 4.761905       48.6900     4.4
997   31.84                 4.761905        1.5920     7.7
998   65.82                 4.761905        3.2910     4.1
999  618.38                 4.761905       30.9190     6.6

In [51]:
import pandas as pd
salesNrows=pd.read_csv("sales.csv",nrows=4)
print(salesNrows)

    Invoice ID Branch       City Customer type  Gender  \
0  750-67-8428      A     Yangon        Member  Female
1  226-31-3081      C  Naypyitaw        Normal  Female
2  631-41-3108      A     Yangon        Normal    Male
3  123-19-1176      A     Yangon        Member    Male

             Product line  Unit price  Quantity   Tax 5%     Total       Date  \
0       Health and beauty       74.69         7  26.1415  548.9715   1/5/2019
1  Electronic accessories       15.28         5   3.8200   80.2200   3/8/2019
2      Home and lifestyle       46.33         7  16.2155  340.5255   3/3/2019
3       Health and beauty       58.22         8  23.2880  489.0480  1/27/2019

    Time      Payment    cogs  gross margin percentage  gross income  Rating
0  13:08      Ewallet  522.83                 4.761905       26.1415     9.1
1  10:29         Cash   76.40                 4.761905        3.8200     9.6
2  13:23  Credit card  324.31                 4.761905       16.2155     7.4
3  20:33      Ewallet  465.76                 4.761905       23.2880     8.4

In [52]:
import pandas as pd
salesNrows=pd.read_csv("sales.csv",nrows=4,usecols=[0,1,6])
print(salesNrows)

    Invoice ID Branch  Unit price
0  750-67-8428      A       74.69
1  226-31-3081      C       15.28
2  631-41-3108      A       46.33
3  123-19-1176      A       58.22

In [53]:
import pandas as pd
salesNrows=pd.read_csv("sales.csv",nrows=4,usecols=["Invoice ID","Branch","Unit price"])
print(salesNrows)

    Invoice ID Branch  Unit price
0  750-67-8428      A       74.69
1  226-31-3081      C       15.28
2  631-41-3108      A       46.33
3  123-19-1176      A       58.22

In [55]:
import pandas as pd
salesNrows=pd.read_csv("sales.csv",nrows=4,usecols=["Invoice ID","Branch","Unit price"])
print(salesNrows)
salesNrows.rename(columns={"Invoice ID":"ID","Branch":"Channel","Unit price":"Price"},inplace=True)
salesNrows

    Invoice ID Branch  Unit price
0  750-67-8428      A       74.69
1  226-31-3081      C       15.28
2  631-41-3108      A       46.33
3  123-19-1176      A       58.22

            ID Channel  Price
0  750-67-8428       A  74.69
1  226-31-3081       C  15.28
2  631-41-3108       A  46.33
3  123-19-1176       A  58.22

In [60]:
import pandas as pd
salesNrows=pd.read_csv("sales.csv",nrows=4,usecols=["Invoice ID","City","Customer type","Product line"])
print(salesNrows)
print("*****************************")
print(salesNrows["Invoice ID"].unique())
print(salesNrows["City"].unique())
print(salesNrows["Customer type"].unique())
print(salesNrows["Product line"].unique())
print(len(salesNrows["Invoice ID"].unique()))
print(len(salesNrows["City"].unique()))

    Invoice ID       City Customer type            Product line
0  750-67-8428     Yangon        Member       Health and beauty
1  226-31-3081  Naypyitaw        Normal  Electronic accessories
2  631-41-3108     Yangon        Normal      Home and lifestyle
3  123-19-1176     Yangon        Member       Health and beauty
*****************************
['750-67-8428' '226-31-3081' '631-41-3108' '123-19-1176']
['Yangon' 'Naypyitaw']
['Member' 'Normal']
['Health and beauty' 'Electronic accessories' 'Home and lifestyle']
4
2

In [65]:
def CleanData_Sales(cell):
    if (cell=="" or cell=="-1" or cell=="not avilable"):
        return "Yangon"
    return cell
def CleanData_REGION(cell):
    if (cell=="" or cell=="-1" or cell=="not avilable"):
        return '1'
    return cell
sales = pd.read_csv("Sales_1.csv", nrows=7, converters={"Branch": CleanData_REGION,
                                                        "Product line": CleanData_Sales})
sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,1,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Yangon,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,1,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3